src/by22/conf/DataProcessors/СформироватьПроводки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СформироватьПроводки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/by22/conf/AccumulationRegisters/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Закупки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/by22/conf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/by22/conf/AccountingRegisters/Проводки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Проводки</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/by22/conf/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/by22/conf/DataProcessors/СформироватьПроводки/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьПроводкиНаСервере(Дата);
	ПоказатьОповещениеПользователя("Готово!");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьПроводкиНаСервере(Дата)
	ВидСубконтоНоменклатура = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
	ВидыНоменклатурыУслуга = Перечисления.ВидыНоменклатуры.Услуга;
	СчетТовары = ПланыСчетов.Управленческий.Товары;
	СчетПоставщики = ПланыСчетов.Управленческий.Поставщики;
	СчетПокупатели = ПланыСчетов.Управленческий.Покупатели;
	СчетПрибылиУбытки = ПланыСчетов.Управленческий.ПрибылиУбытки;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗакупкиОбороты.Номенклатура КАК Номенклатура,
		|	ЗакупкиОбороты.СуммаОборот КАК СуммаОборот,
		|	ЗакупкиОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.Закупки.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ЗакупкиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ПродажиОбороты.СебестоимостьОборот КАК СебестоимостьОборот,
		|	ПродажиОбороты.ВыручкаОборот КАК ВыручкаОборот,
		|	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоМесяца, &КонецМесяца, , ) КАК ПродажиОбороты");
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	// Поступления
	ДокОбъект = Документы.Операция.СоздатьДокумент();
	ДокОбъект.Дата = КонецМесяца(Дата);
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	НаборЗаписей = РегистрыБухгалтерии.Проводки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокОбъект.Ссылка);
	
	Выборка = РезультатПакет[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Проводка = НаборЗаписей.Добавить();
		Проводка.Период	 = ДокОбъект.Дата;
		Проводка.СчетДт	 = СчетТовары;
		Проводка.СчетКт	 = СчетПоставщики;
		Проводка.СубконтоДт[ВидСубконтоНоменклатура] = Выборка.Номенклатура;
		Проводка.Сумма	 = Выборка.СуммаОборот;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	// Продажи
	ДокОбъект = Документы.Операция.СоздатьДокумент();
	ДокОбъект.Дата = КонецМесяца(Дата);
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	НаборЗаписей = РегистрыБухгалтерии.Проводки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокОбъект.Ссылка);
	
	Выборка = РезультатПакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Проводка = НаборЗаписей.Добавить();
		Проводка.Период	 = ДокОбъект.Дата;
		Проводка.СчетДт	 = СчетПокупатели;
		Проводка.СчетКт	 = СчетПрибылиУбытки;
		Проводка.Сумма	 = Выборка.ВыручкаОборот;
		
		Если Выборка.ВидНоменклатуры <> ВидыНоменклатурыУслуга Тогда
			Проводка = НаборЗаписей.Добавить();
			Проводка.Период			 = ДокОбъект.Дата;
			Проводка.СчетДт			 = СчетПрибылиУбытки;
			Проводка.СчетКт			 = СчетТовары;
			Проводка.СубконтоКт[ВидСубконтоНоменклатура] = Выборка.Номенклатура;
			Проводка.КоличествоКт	 = Выборка.КоличествоОборот;
			Проводка.Сумма			 = Выборка.СебестоимостьОборот;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
КонецПроцедуры
